app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG-13', 'R') ORDER BY release_date ASC
---
  def index
    #debugger
    if params[:sort] == 'title'
      @sort='title'
      @movies = Movie.all(:order => "title ASC")
    elsif params[:sort] == 'date'
      @sort='date'
      @movies = Movie.all(:order => "release_date ASC")
    else
      @sort='none'
      @movies = Movie.all
    end

    if !params[:ratings].nil?
      @movies = Movie.where(rating: params[:ratings].keys)